package com.xiaoyv404.mirai.app.bilibili

import kotlinx.serialization.Serializable

@Serializable
data class VideoDataJson(
    val code: Int,
    val `data`: Data,
    val message: String,
    val ttl: Int,
)

@Serializable
data class Data(
    val aid: Int,
    val bvid: String,
    val cid: Int,
    val copyright: Int,
    val desc: String,
    val dimension: Dimension,
    val `dynamic`: String,
    val owner: Owner,
    val pic: String,
    val pubdate: Int,
    val stat: Stat,
    val tid: Int,
    val title: String,
    val tname: String,
    val videos: Int,
)

@Serializable
data class Dimension(
    val height: Int,
    val rotate: Int,
    val width: Int,
)

@Serializable
data class Owner(
    val face: String,
    val mid: Int,
    val name: String,
)

@Serializable
data class Stat(
    val aid: Int,
    val argue_msg: String,
    val coin: Int,
    val danmaku: Int,
    val dislike: Int,
    val evaluation: String,
    val favorite: Int,
    val his_rank: Int,
    val like: Int,
    val now_rank: Int,
    val reply: Int,
    val share: Int,
    val view: Int,
)

@Serializable
data class AbnormalVideoDataJson(
    val code: Int,
    val message: String,
    val ttl: Int,
)

//分区表
val tID = mapOf(
    1 to "动画",
    24 to "动画-MAD·AMV mad", //:\n具有一定制作程度的动画或静画的二次创作视频
    25 to "动画-MMD·3D mmd", //:\n使用MMD（MikuMikuDance）和其他3D建模类软件制作的视频
    47 to "动画-短片·手书", //:\n追求创新并具有强烈特色的短片、手书（绘）及ACG相关配音
    86 to "动画-特摄", //:\n特摄相关衍生视频
    27 to "动画-综合", //:\n以动画及动画相关内容为素材，包括但不仅限于音频替换、杂谈、排行榜等内容

    13 to "番剧",
    33 to "番剧-连载动画", //:\n当季连载的动画番剧
    32 to "番剧-完结动画", //:\n已完结的动画番剧合集
    51 to "番剧-资讯", //:\n动画番剧相关资讯视频
    152 to "番剧-官方延伸", //:\n动画番剧为主题的宣传节目、采访视频，及声优相关视频

    167 to "国创",
    153 to "国创-国产动画:",
    168 to "国创-国产原创相关:",
    169 to "国创-布袋戏:",
    195 to "国创-动态漫·广播剧:",
    170 to "国创-资讯:",

    3 to "音乐",
    28 to "音乐-原创音乐", //:\n个人或团队制作以音乐为主要原创因素的歌曲或纯音乐
    31 to "音乐-翻唱", //:\n一切非官方的人声再演绎歌曲作品
    30 to "音乐-VOCALOID·UTAU", //:\n以雅马哈Vocaloid和UTAU引擎为基础，包含其他调教引擎，运用各类音源进行的歌曲创作内容
    194 to "音乐-电音", //:\n以电子合成器、音乐软体等产生的电子声响制作的音乐
    59 to "音乐-演奏", //:\n传统或非传统乐器及器材的演奏作品
    193 to "音乐-MV", //:\n音乐录影带，为搭配音乐而拍摄的短片
    29 to "音乐-音乐现场", //:\n音乐实况表演视频
    130 to "音乐-音乐综合", //:\n收录无法定义到其他音乐子分区的音乐视频

    129 to "舞蹈",
    20 to "舞蹈-宅舞", //:\n与ACG相关的翻跳、原创舞蹈
    198 to "舞蹈-街舞", //:\n收录街舞相关内容，包括赛事现场、舞室作品、个人翻跳、FREESTYLE等
    199 to "舞蹈-明星舞蹈", //:\n国内外明星发布的官方舞蹈及其翻跳内容
    200 to "舞蹈-中国舞", //:\n传承中国艺术文化的舞蹈内容，包括古典舞、民族民间舞、汉唐舞、古风舞等
    154 to "舞蹈-舞蹈综合", //:\n收录无法定义到其他舞蹈子分区的舞蹈视频
    156 to "舞蹈-舞蹈教程", //:\n镜面慢速，动作分解，基础教程等具有教学意义的舞蹈视频

    4 to "游戏",
    17 to "游戏-单机游戏", //:\n以所有平台（PC、主机、移动端）的单机或联机游戏为主的视频内容，包括游戏预告、CG、实况解说及相关的评测、杂谈与视频剪辑等
    171 to "游戏-电子竞技", //:\n具有高对抗性的电子竞技游戏项目，其相关的赛事、实况、攻略、解说、短剧等视频
    172 to "游戏-手机游戏", //:\n以手机及平板设备为主要平台的游戏，其相关的实况、攻略、解说、短剧、演示等视频
    65 to "游戏-网络游戏", //:\n由网络运营商运营的多人在线游戏，以及电子竞技的相关游戏内容。包括赛事、攻略、实况、解说等相关视频
    173 to "游戏-桌游棋牌", //:\n桌游、棋牌、卡牌对战等及其相关电子版游戏的实况、攻略、解说、演示等视频
    121 to "游戏-GMV", //:\n由游戏素材制作的MV视频。以游戏内容或CG为主制作的，具有一定创作程度的MV类型的视频
    136 to "游戏-音游", //:\n各个平台上，通过配合音乐与节奏而进行的音乐类游戏视频
    19 to "游戏-Mugen", //:\n以Mugen引擎为平台制作、或与Mugen相关的游戏视频

    36 to "知识",
    201 to "知识-科学科普", //:\n回答你的十万个为什么
    124 to "知识-社科人文(趣味科普人文)", //:\n聊聊财经/社会/法律，看看历史趣闻，品品人文艺术
    207 to "知识-财经", //:\n宏观经济分析，证券市场动态，商业帝国故事，知识与财富齐飞~
    208 to "知识-校园学习", //:\n老师很有趣，同学多人才，我们都爱搞学习
    209 to "知识-职业职场", //:\n职场加油站，成为最有料的职场人
    122 to "知识-野生技术协会", //:\n是时候展现真正的技术了
    39 to "知识-演讲·公开课", //:\n涨知识的好地方，给爱学习的你
    96 to "知识-星海", //:\n军事类内容的圣地
    98 to "知识-机械", //:\n机械设备展示或制作视频

    188 to "数码",
    95 to "数码-手机平板", //:\n手机平板设备相关视频
    189 to "数码-电脑装机", //:\n电脑装机及配件等相关视频
    190 to "数码-摄影摄像", //:\n摄影摄像器材等相关视频
    191 to "数码-影音智能", //:\n影音设备、智能产品等相关视频

    160 to "生活",
    138 to "生活-搞笑", //:\n搞笑的、轻松有趣的、具有独特笑点或娱乐精神的视频
    21 to "生活-日常", //:\n漫展、cosplay、体育运动及其他一般日常向视频
    //76 to "生活-美食圈:\n美食鉴赏&料理制作教程",
    75 to "生活-动物圈", //:\n这里有各种萌萌哒动物哦
    161 to "生活-手工", //:\n简易手工艺品的diy制作视频，例如；折纸、手账、橡皮章等
    162 to "生活-绘画", //:\n绘画爱好者们关于绘画技巧、绘图过程的分享交流场所
    163 to "生活-运动", //:\n一般向运动项目以及惊险刺激的户外极限运动
    176 to "生活-汽车", //:\n专业汽车资讯，分享车生活
    174 to "生活-其他", //:\n对于分区归属不明的视频进行归纳整合的特定分区

    211 to "美食",
    76 to "美食制作(原[生活]->[美食圈])", //\n学做人间美味，展示精湛厨艺
    212 to "美食侦探", //\n寻找美味餐厅，发现街头美食
    213 to "美食测评", //\n吃货世界，品尝世间美味
    214 to "田园美食", //\n品味乡野美食，寻找山与海的味道
    215 to "美食记录", //\n记录一日三餐，给生活添一点幸福感

    119 to "鬼畜",
    22 to "鬼畜-鬼畜调教", //:\n使用素材在音频、画面上做一定处理，达到与BGM一定的同步感
    26 to "鬼畜-音MAD", //:\n使用素材音频进行一定的二次创作来达到还原原曲的非商业性质稿件
    126 to "鬼畜-人力VOCALOID", //:\n将人物或者角色的无伴奏素材进行人工调音，使其就像VOCALOID一样歌唱的技术
    127 to "鬼畜-教程演示", //:\n鬼畜相关的教程演示


    155 to "时尚",
    157 to "时尚-美妆", //:\n涵盖妆容、发型、美甲等教程，彩妆、护肤相关产品测评、分享等
    158 to "时尚-服饰", //:\n服饰风格、搭配技巧相关的展示和教程视频
    164 to "时尚-健身", //:\n器械、有氧、拉伸运动等，以达到强身健体、减肥瘦身、形体塑造目的
    159 to "时尚-T台", //:\n发布会走秀现场及模特相关时尚片、采访、后台花絮
    192 to "时尚-风尚标", //:\n时尚明星专访、街拍、时尚购物相关知识科普

    202 to "资讯",
    203 to "资讯-热点", //:\n全民关注的时政热门资讯
    204 to "资讯-环球", //:\n全球范围内发生的具有重大影响力的事件动态
    205 to "资讯-社会", //:\n日常生活的社会事件、社会问题、社会风貌的报道
    206 to "资讯-综合", //:\n除上述领域外其它垂直领域的综合资讯

    165 to "广告",
    166 to "广告-娱乐",

    5 to "娱乐",
    71 to "娱乐-综艺", //:\n国内外有趣的综艺和综艺相关精彩剪辑
    137 to "娱乐-明星", //:\n娱乐圈动态、明星资讯相关
    131 to "娱乐-Korea相关", //:\nKorea相关音乐、舞蹈、综艺等视频

    181 to "影视",
    182 to "影视-影视杂谈", //:\n影视评论、解说、吐槽、科普等
    183 to "影视-影视剪辑", //:\n对影视素材进行剪辑再创作的视频
    85 to "影视-短片", //:\n追求自我表达且具有特色的短片
    184 to "影视-预告·资讯", //:\n影视类相关资讯，预告，花絮等视频
)
